// একটি function লিখ, যেটা একটি income amount প্যারামিটার হিসেবে নিবে এবং কোন tax bracket-এ পড়ে, সেটা রিটার্ন করবে। ইনকাম যদি ≤ 50,000-এর নিচে হয়, তাহলে 10 রিটার্ন করবে। ইনকাম 50,001–100,000-এর মধ্যে হলে 20 ট্যাক্স হবে। আবার 100,001–200,000-এর মধ্যে হলে 30, আর $200,000 উপরে হলে 40 শতাংশ ট্যাক্স হবে। ফাংশন থেকে শুধু সংখ্যা রিটার্ন করবি। কোন পারসেন্টেজ চিহ্ন রিটার্ন করবি না।

function incomeTax (income) {
    if (income <= 50000) return 10;
    if (income > 50000 && income < 100000) return 20;
    if (income > 100000 && income < 200000) return 30;
    if (income >= 200000) return 40;
}
console.log(incomeTax(199999));
console.log(incomeTax(200000));